```Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.app.data.aws_caller_identity.current: Refreshing state...
module.app.data.aws_iam_account_alias.current: Refreshing state...
module.app.data.aws_ssm_parameter.s3_cloudfront_connection: Refreshing state...
data.aws_route53_zone.hosted_zone: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.app.data.aws_iam_policy_document.static_website_read_with_secret will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "static_website_read_with_secret"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "1"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "Q5Ukg9tI3OzgGIpP",
                ]
              + variable = "aws:UserAgent"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app.aws_acm_certificate.url_cert will be created
  + resource "aws_acm_certificate" "url_cert" {
      + arn                       = (known after apply)
      + domain_name               = "map-dev.byu.edu"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.app.aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.app.aws_api_gateway_account.apigw_account will be created
  + resource "aws_api_gateway_account" "apigw_account" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.app.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
    }

  # module.app.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.app.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.app.aws_api_gateway_method_settings.method_settings will be created
  + resource "aws_api_gateway_method_settings" "method_settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "dev"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = (known after apply)
          + throttling_rate_limit                      = (known after apply)
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.app.aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "sendEmail"
      + rest_api_id = (known after apply)
    }

  # module.app.aws_api_gateway_resource.rest_resource will be created
  + resource "aws_api_gateway_resource" "rest_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "rest"
      + rest_api_id = (known after apply)
    }

  # module.app.aws_api_gateway_rest_api.email_api will be created
  + resource "aws_api_gateway_rest_api" "email_api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "campus-map-ui-dev-send-email-api"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # module.app.aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "map-dev.byu.edu",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "CDN for campus-map-ui-dev S3 Bucket and API"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "campus-map-ui-dev-dev-s3staticsite"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/rest/*"
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "campus-map-ui-dev-dev-s3staticsite"

          + custom_header {
              + name  = "User-Agent"
              + value = "Q5Ukg9tI3OzgGIpP"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = (known after apply)
          + origin_id   = (known after apply)
          + origin_path = "/dev"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.1_2016"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.app.aws_cloudwatch_log_group.email_api_logs will be created
  + resource "aws_cloudwatch_log_group" "email_api_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 7
    }

  # module.app.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "lambda_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.app.aws_iam_policy.send_email_lambda will be created
  + resource "aws_iam_policy" "send_email_lambda" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = (known after apply)
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.app.aws_iam_role.cloudwatch will be created
  + resource "aws_iam_role" "cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api_gateway_cloudwatch_global"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::110877218140:policy/iamRolePermissionBoundary"
      + unique_id             = (known after apply)
    }

  # module.app.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::110877218140:policy/iamRolePermissionBoundary"
      + unique_id             = (known after apply)
    }

  # module.app.aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.app.aws_iam_role_policy_attachment.email_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "email_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # module.app.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # module.app.aws_lambda_function.email_lambda will be created
  + resource "aws_lambda_function" "email_lambda" {
      + arn                            = (known after apply)
      + function_name                  = "campus-map-ui-dev-email-lambda"
      + handler                        = "sendEmail.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs10.x"
      + s3_bucket                      = "campus-map-ui-dev-dev-s3staticsite"
      + s3_key                         = "sendEmail.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.app.aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "campus-map-ui-dev-email-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[0] will be created
  + resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[1] will be created
  + resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[2] will be created
  + resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.custom-url-4a will be created
  + resource "aws_route53_record" "custom-url-4a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "map-dev.byu.edu"
      + type            = "AAAA"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.custom-url-a will be created
  + resource "aws_route53_record" "custom-url-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "map-dev.byu.edu"
      + type            = "A"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.domain_verification will be created
  + resource "aws_route53_record" "domain_verification" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.example.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.secondary_url_4a[0] will be created
  + resource "aws_route53_record" "secondary_url_4a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "maps-dev.byu.edu"
      + type            = "AAAA"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = "maps-dev.byu.edu"
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.secondary_url_a[0] will be created
  + resource "aws_route53_record" "secondary_url_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "maps-dev.byu.edu"
      + type            = "A"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = "maps-dev.byu.edu"
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.url_cert_validation will be created
  + resource "aws_route53_record" "url_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_s3_bucket.secondary_site[0] will be created
  + resource "aws_s3_bucket" "secondary_site" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "maps-dev.byu.edu"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "map-dev.byu.edu"
        }
    }

  # module.app.aws_s3_bucket.static-website will be created
  + resource "aws_s3_bucket" "static-website" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "campus-map-ui-dev-dev-s3staticsite"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + index_document = "index.html"
        }
    }

  # module.app.aws_s3_bucket_policy.static_website_read_with_secret will be created
  + resource "aws_s3_bucket_policy" "static_website_read_with_secret" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.app.aws_ses_domain_dkim.domain will be created
  + resource "aws_ses_domain_dkim" "domain" {
      + dkim_tokens = (known after apply)
      + domain      = "map-dev.byu.edu"
      + id          = (known after apply)
    }

  # module.app.aws_ses_domain_identity.domain will be created
  + resource "aws_ses_domain_identity" "domain" {
      + arn                = (known after apply)
      + domain             = "map-dev.byu.edu"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # module.app.aws_ses_domain_identity_verification.example_verification will be created
  + resource "aws_ses_domain_identity_verification" "example_verification" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```